travel/app/controllers/receipts_controller.rb

  def index
  	@receipts = Receipt.all
---
SELECT `receipts`.* FROM `receipts`

  def create
  		@receipt = Receipt.new(receipt_params)

		if @receipt.save
---
INSERT INTO `receipts` (`name`, `attachment`, `created_at`, `updated_at`) VALUES ('asdfsd', '17457258_10209071267434811_7360810766715170552_n.jpg', '2017-04-27 01:07:42', '2017-04-27 01:07:42')